fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	
	ДлительнаяОперация = НачатьВыполнениеНаСервере(); 
    ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект); 
    ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект); 
    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
    
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НачатьВыполнениеНаСервере()

	 ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
     Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,"Обработки.ВКМ_МассовоеСозданиеАктов.Списокреализаций",
        Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания); 

КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
    
    	Возврат; 
    
    КонецЕсли;   
    
    СписокРеализацийМассив = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
    ЗаполнитьСписокРеализаций(СписокРеализацийМассив); 

КонецПроцедуры 
&НаКлиенте
Процедура  ЗаполнитьСписокРеализаций(СписокРеализацийМассив)
    
     Объект.ТабличнаяЧасть.Очистить();
     
     Для каждого Строка Из СписокРеализацийМассив Цикл
     
     	 НоваяСтрока = Объект.СписокРеализаций.Добавить(); 
         НоваяСтрока.Договор = Строка.Договор; 
         НоваяСтрока.Реализация = Строка.Реализация; 
     
     КонецЦикла;

КонецПроцедуры
#КонецОбласти
